Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ འདས་པ་ དེ འི་ ཕ་རོལ་ གྱི་ ཡང་ ཆེས་ ཕ་རོལ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྣམ་པར་ བསྒྲགས་པ འི་ སྒྲ་ ཞེས་ བྱ་བ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ལྷུན་པོ འི་ ཕུང་པོ་ ཞེས་ བྱ་བ་ ད་ལྟ ར་ བཞུགས་ ཏེ་
en: $248 At that time there was in the east—beyond countless and limitless universes—a world known as Sound of Renown. |#| Within that universe resided a thus-gone one, a worthy one, a perfect buddha known as Majestic Mountain.

source: བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ལྷུན་པོ འི་ ཕུང་པོ་ དེས་ ཀྱང་ བྱང་ཆུབ་ སེམས་དཔའ་ འོད་ ཀྱི་ དཀྱིལ་འཁོར་ གཟི་བརྗིད་ ཕུང་པོ་ ཞེས་ བྱ་བ་ ང འི་ འོག་ ཏུ་ འདི་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ ར་ འཚང་རྒྱ་བ ར་ འགྱུར་ རོ་ ཞེས་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏེ་ འཁོར་ དེ་ཉིད་ དུ་ འདུས་པ ར་ གྱུར་ ནས་ |#| འདུག་ གོ །_།
en: The blessed one, the thus-gone one, the worthy one, the perfect buddha Majestic Mountain had just prophesied that following himself the bodhisattva Luminous Sphere of Great Splendor, who was present in the gathering there, would awaken to unsurpassable and perfect buddhahood.

source: བྱང་ཆུབ་ སེམས་དཔའ་ འོད་ ཀྱི་ དཀྱིལ་འཁོར་ གཟི་བརྗིད་ ཕུང་ པོ ས་ སྣང་བ་ ཆེན་པོ་ དེ་ མཐོང་ སྟེ་ |#| གསུང་ བསལ་བ འི་ སྒྲ་ དེ་ཡང་ ཐོས་ ཤིང་ ས་གཡོས་པ་ ཆེན་པོ་ དེ་ཡང་ ཀུན་ དུ་ ཤེས་ ནས་
en: $249 The bodhisattva Luminous Sphere of Great Splendor had witnessed the great light, heard the special sound, and sensed the ground quaking.

source: དེ་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ ལྷུན་པོ འི་ ཕུང་པོ་ ག་ལ་བ་ དེར་ སོང་ སྟེ་ |#| ཕྱིན་ ནས་ |#| བཅོམ་ལྡན་འདས་ དེ་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: Now he approached the blessed thus-gone Majestic Mountain and asked,

source: བཅོམ་ལྡན་འདས་ འོད་ དེ་ དང་ །_ གསུང་ བསལ་བ འི་ སྒྲ་ དེ་ དང་ །_ དོག་ས་ གཡོས་པ་ དེ་ སུ འི་ ལགས །_
en: “Blessed One, who is behind this light, this special sound, and the ground shaking?”

source: བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ ལྷུན་པོ འི་ ཕུང་པོ ས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ འོད་ ཀྱི་ དཀྱིལ་འཁོར་ གཟི་བརྗིད་ ཕུང་པོ་ ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ །_།
en: $250 The blessed one, the thus-gone one, the worthy one, the perfect buddha Majestic Mountain then said to the bodhisattva Luminous Sphere of Great Splendor,

source: རིགས་ ཀྱི་ བུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ འདི་ ནས་ ནུབ་ཕྱོགས་ ཀྱི་ ཕྱོགས་ཆ ར་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ འདས་པ་ དེ འི་ ཕ་རོལ་ གྱི་ ཡང་ ཆེས་ ཕ་རོལ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ ཅེས་བྱ་བ་ ཡོད་ དེ
en: “Noble son, to the west of this buddha realm, far beyond countless and limitless universes, there is a world known as Enduring.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་ པ འི་ སངས་རྒྱས་ ཤཱཀྱ་ ཐུབ་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resides the thus-gone one, the worthy one, the perfect buddha Śākyamuni.

source: འཚོ་ ཞིང་ གཞེས་ ལ་ འདི་ལྟ་སྟེ །_ |#| བྱང་ཆུབ་ སེམས་དཔ འི་ སྡེ་སྣོད་ ཀྱི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ ཀྱི་ ཆོས་ ཀྱང་ སྟོན་ ཏོ །_། |#| བྱང་ཆུབ་ སེམས་དཔའ་ དཔེ་མེད་པ་ སེམས་པ་ ཞེས་ བྱ་བ་ དག་ ཡོད་ དེ་ འཁོར་ དེར་ འདུས་པ ར་ གྱུར་ ནས་ འཁོད་ དོ །_།
en: Abiding and remaining present there, he is delivering Dharma teachings on the Bodhisattva Collection to a retinue that contains incomparable bodhisattva beings. [47.b]

source: [47b] རིགས་ ཀྱི་ བུ་ ཕྱོགས་ བཅུ ར་ འཇིག་རྟེན་ གྱི་ ཁམས་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ སྙེད་ གོ་ཆ་ གང་དག་ གིས་ སྐྱེས་བུ་ དམ་པ་ དེ་དག་ གོ་ཆ་ བགོས་པ འི་ གོ་ཆ་ དེ་ལྟ་ བུ་ དག་ གིས་ སྟོང་ སྟེ །_
en: Noble son, in the ten directions, throughout universes as numerous as the grains of sand in the river Ganges, there is nobody who wears an armor as strong as the one that is borne by those holy beings.

source: རིགས་ ཀྱི་ བུ་ སྐྱེས་བུ་ དམ་པ་ དེ་ལྟ་ བུ་ དག་ ཐོས་པ་ ཡང་ མཆོག་ ཏུ་ རྙེད་པ ར་ དཀའ་ ན་ བལྟ་བ འམ །_ བསྙེན་བཀུར་ བྱ་བ་ ལྟ་ཅི་ སྨོས །_
en: Noble son, even coming to hear of these beings is extremely difficult, let alone beholding and venerating them.”

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ དེ་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ འོད་ ཀྱི་ དཀྱིལ་འཁོར་ གཟི་བརྗིད་ ཕུང་པོ ས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: said the bodhisattva Luminous Sphere of Great Splendor,

source: བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ ཤཱཀྱ་ ཐུབ་པ་ དེ་ ལ་ བལྟ་བ་ དང་ །_ ཕྱག་ བགྱི་བ་ དང་ །_ བསྙེན་བཀུར་ བགྱི་བ་ དང་ །_ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ བསམ་ གྱིས་ མི་ ཁྱབ་པ འི་ གོ་ཆ་ བགོས་པ་ དེ་དག་ ཀྱང་ བལྟ་བ འི་ སླད་ དུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ དེར་ བདག་ མཆི་བ ར་ བགྱི འོ །_།
en: $251 “Blessed One,” |#| “I wish to go to that world known as Enduring, so that I may see, venerate, and serve the blessed thus-gone Śākyamuni, and so that I may see those bodhisattva great beings who bear such inconceivable armor.”

source: རིགས་ ཀྱི་ བུ་ དེ འི་ དུས་ ལ་ད་ བབ་པ ར་ ཤེས་ ན་ |#| སོང་ ལ །_
en: $252 “Noble son, if you know that the time has come, then go,” replied the blessed Majestic Mountain.

source: བཅོམ་ལྡན་འདས་ དེ་ ལ་ པད་མ་ བདུན་པོ་ འདི་དག་ ཀྱང་ ཕུལ་ ཏེ་ |#| ཕུལ་ ནས་ |#| ཀྱང་ །_
en: “Offer that blessed one these seven lotus flowers, and

source: བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ ལྷུན་པོ འི་ ཕུང་པོ་ གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ང་བ་ ཉུང་ ངམ །_ བསྐྱོད་པ་ ཡང་ ངམ །_ སྟོབས་ དང་ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ །_ ཞེས་ སྙུན་ གསོལ་ ལོ་ ཞེས་ དེ་སྐད་ ཅེས་ གསོལ་ ཅིག _།
en: tell him that the blessed thus-gone Majestic Mountain inquires whether he has encountered but little hardship and discomfort, and whether he remains healthy, strong, and at ease.”

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ འོད་ ཀྱི་ དཀྱིལ་འཁོར་ གཟི་བརྗིད་ ཕུང་པོ ས་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ ལྷུན་པོ འི་ ཕུང་པོ་ དེ་ ལ་ རྣམ་པར་ བལྟས་ ཏེ །_
en: $253 The bodhisattva great being Luminous Sphere of Great Splendor then looked at the thus-gone Majestic Mountain.

source: བཅོམ་ལྡན་འདས་ དེ འི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ནས་ བཅོམ་ལྡན་འདས་ དེ འི་ ཐད་ ནས་ སོང་ ངོ་ །_།
en: He bowed his head to the Thus-Gone One’s feet and then left.

source: བྱང་ཆུབ་ སེམས་དཔ འི་ འོད་ ཀྱི་ དཀྱིལ་འཁོར་ གཟི་བརྗིད་ ཕུང་པོ་ དེ་ འདི་ལྟ་སྟེ་ དཔེར་ན །_ |#| སྐྱེས་བུ་ སྟོབས་ དང་ ལྡན་པ་ ཞིག་ གིས་ ལག་པ་ བསྐུམ་པ་ རྐྱོང་བ ར་ བྱེད་པ འམ །_ ལག་པ་ བརྐྱང་བ་ སྐུམ་པ ར་ བྱེད་པ འི་ སྐད་ཅིག་ དེས་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྣམ་པར་ བསྒྲགས་པ འི་ སྒྲ་ ནས་ མི་སྣང་བ ར་ གྱུར་ ཏེ |#| འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདིར་ འདུག་ གོ །_།
en: As fast as an athlete can stretch out or bend an arm, the bodhisattva Luminous Sphere of Great Splendor now disappeared from that universe and instantaneously appeared here in the world of Enduring.

source: དེ་ རྒྱལ་པོ འི་ ཁབ་ འོད་མ འི་ ཚལ་ བྱ་ ཀ་ ལན་ ད་ ཀ་ གནས་པ་ ག་ལ་བ་ དེར་ སོང་ སྟེ་ |#| ཕྱིན་ ནས་
en: Arriving at the Kalandaka­nivāpa in the Veṇuvana by Rājagṛha he went before the Blessed One.

source: བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ |#| ཕྱོགས་ གཅིག་ ཏུ་ འདུག་ [48a] གོ །_།
en: He bowed his head to the Blessed One’s feet and sat to one side. [48.a]

source: ཕྱོགས་ གཅིག་ ཏུ་ འདུག་ ནས་ ཀྱང་ བཅོམ་ལྡན་འདས་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: Then he addressed the Blessed One:

source: བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ ལྷུན་པོ འི་ ཕུང་པོ་ གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ང་བ་ ཉུང་ ངམ །_ བསྐྱོད་པ་ ཡང་ ངམ །_ སྟོབས་ དང་ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ་ ཞེས་ སྙུན་ གསོལ་ ཞིང་ །_
en: “Blessed One, the blessed thus-gone Majestic Mountain inquires whether you have encountered but little hardship or discomfort, and whether you remain healthy, strong, and at ease.

source: བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ ལ་ བཅོམ་ལྡན་འདས་ དེས་ པད་མ་ འདི་དག་ ཀྱང་ བསྐུར་བ་ ལགས་སོ །_།
en: He also sends you these lotus flowers.”

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ པད་མ་ དེ་དག་ བཞེས་ ཏེ་ |#| བཞེས་ ནས་ |#| ཀྱང་ བཀའ་ སྩལ་པ །_
en: $254 The Blessed One accepted the flowers and asked,

source: འོད་ ཀྱི་ དཀྱིལ་འཁོར་ གཟི་བརྗིད་ ཕུང་ པོ་ ཅི་ བཅོམ་ལྡན་འདས་ དེ་ སྙུན་ མི་ མངའའམ །_ སྟོབས་ དང་ ལྡན་ ནམ །_ འགྱུར་བ་ མི་ མངའའམ །_ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ །_
en: “Luminous Sphere of Great Splendor, is that blessed one free from ailments? |#| Is he strong and does he remain unchanged and happy?”

source: བཅོམ་ལྡན་འདས་ དེ་ལྟ་ ལགས་ ཏེ །_
en: $255 “Yes, Blessed One,”

source: སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ ན་ སྙུན་ མི་ མངའ་ ཞིང་ སྟོབས་ དང་ ལྡན་ ཏེ་ |#| འགྱུར་བ་ མི་ མངའ་ ལ་ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ ལགས་སོ །_།
en: “he is free from ailments and strong. |#| He remains unchanged and happy within his buddha realm.”

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ མ་ཕམ་པ་ ལ་མ་ ཕམ་པ་ ཁྱོད་ ཀྱིས་ བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ ཡོངས་སུ་ རྫོགས་པ ར་ བྱ་བ འི་ ཕྱིར་ པད་མ་ འདི་དག་ གིས་ དགེ་བ འི་ རྩ་བ་ དག་ སྐྱེད་ ཅིག་ ཅེས་ པད་མ་ དེ་དག་ བྱིན་ ནོ །_།
en: $256 The Blessed One now gave the lotus flowers to the bodhisattva Ajita and said, “Ajita, so that you may perfect the branches of awakening, take these lotuses and use them to engender roots of virtue.”

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ མ་ཕམ་པ ས་ པད་མ་ ཆེན་པོ་ བདུན་པོ་ དེ་དག་ བླངས་ ནས་ བཟང་སྐྱོང་ ལ་སོགས་པ་ བྱང་ཆུབ་ སེམས་དཔའ་ དཔེ་མེད་པ་ སེམས་པ་ དག་ ལ་ བྱིན་ ཏེ །_
en: $257 The bodhisattva Ajita, receiving thus the seven great lotus flowers, in turn passed them on to Bhadrapāla and other such incomparable bodhisattvas,

source: འདི་ལྟ་སྟེ །_ དཀོན་མཆོག་ འབྱུང་གནས་ དང་ །_ དེད་དཔོན་ བཟང་པོ་ དང་ །_ ཡོན་ཏན་ སྦས་ དང་ །_ འདམ་ བུ ས་ བྱིན་ དང་ །_ དབང་པོ ས་ བྱིན་ དང་ །_ ཆུ་ལྷ་ དང་ །_ སྟོབས་ བཟངས་ དང་ །_ བླ་མ འི་ བློ་གྲོས་ དང་ །_ ཁྱད་པར་ བློ་གྲོས་ དང་ །_ འཕེལ་བ འི་ བློ་གྲོས་ དང་ །_ མཐོང་བ་ དོན་ཡོད་ དང་ །_ ལེགས་པ ར་ ཡང་དག་ ཞུགས་ དང་ །_ རབ་ ཀྱི་ རྩལ་ གྱིས་ རྣམ་པར་ གནོན་ དང་ །_ རྟག་ ཏུ་ བརྩོན་ དང་ །_ བརྩོན་པ་ མི་ གཏོང་བ་ དང་ །_ ཉི་མ འི་ སྙིང་པོ་ དང་ །_ འགྲོ་བ་ འཛིན་ དང་ །_ ས་འཛིན་ དང་ །_ ལེགས་པ ར་ གནས་པ འི་ བློ་གྲོས་ དང་ །_ མཐའ་ ཡ ས་ བློ་གྲོས་ དང་ །_ འཇིག་རྟེན་ གསུམ་ རྣམ་པར་ གནོན་ དང་ །_ མཐའ་ ཡ ས་ རྣམ་པར་ གནོན་ དང་ །_ དཔག་མེད་ རྣམ་པར་ གནོན་ [48b] དང་ །_ དམིགས་པ་ ཐམས་ཅད་ སྟོན་པ འི་ ཁྱུ་མཆོག་ དང་ །_ བརྟན་པ འི་ བློ་གྲོས་ དང་ །_ མཐའ་ ཡ ས་ བརྩོན་འགྲུས་ དང་ །_ དཔག་ཡས་ རྣམ་པར་ གནོན་ དང་ །_ དོན་ཡོད་ བརྩོན་འགྲུས་ དང་ །_ སེང་གེ འི་ བརྩོན་འགྲུས་ རྩལ་ གྱིས་ འགྲོ་ དང་ །_ དོན་ཡོད་ གོམ་པ འི་ རྩལ་ གྱིས་ འགྲོ་ དང་ དགའ་བ འི་ སྤོབས་པ་ དང་ །_ སྤོབས་པ་ རྣོན་པོ་ དང་ །_ སྤོབས་པ་ ཟབ་པ་ དང་ །_ སྤོབས་པ་ མཐའ་ ཡ ས་ དང་ །_ སྤོབས་པ་ དཔག་མེད་ དང་ །_ འཇམ་དཔལ་ གཞོན་ནུ ར་ གྱུར་པ་ དང་ །_ པད་མ འི་ སྙིང་པོ་ དང་ །_ མཐའ་ ཡ ས་ གླང་པོ་ཆེ་ དང་ །_ སྤར་ འཆུམས་ མ་ ཡིན་ དང་ །_ ཆོས་ འཕགས་ དང་ །_ ལག་ ན་ རིན་ཆེན་ དང་ །_ རིན་ཆེན་ ལག་པ་ དང་ །_ དོན་ཡོད་ དཔལ་ དང་ །_ མི་ གཡོས་ རྣམ་པར་ གནོན་ དང་ །_ མྱ་ངན་མེད་པ་ དང་ །_ མྱ་ངན་ བྲལ་ དང་ །_ ཐ་ མི་ དད་པ ར་ སྤྱོད་པ ར་ ཡང་དག་ ཞུགས་ དང་ །_ བརྩོན་འགྲུས་ སྐྱོ་མེད་ དང་ །_ མངལ་ འགྱུར་ དང་ །_ བུད་མེད་ འགྱུར་ དང་ །_ སྐྱེས་པ་ འགྱུར་ དང་ །_ སེམས་ཅན་ འགྱུར་ དང་ །_ དྲ་བ་ ཅན་ གྱི་ འོད་ དང་ །_ མཐའ་ ཡ ས་ སྙིང་པོ་ དང་ །_ སངས་རྒྱས་ ཕྱག་ ན་ པད་མ་ སྐྱེས་ དང་ །_ ལག་ ན་ པད་མ་ དང་ །_ སྤོས་ ཀྱི་ གླང་པོ་ཆེ་ དང་ །_ དོན་གྲུབ་ དང་ །_ སེང་གེ འི་ ལེགས་པ ར་ བརྟགས་པ འི་ གོ་ཆ་ དང་ །_ དོན་ཡོད་ གོ་ཆ་ དང་ །_ མ་སྨད་པ འི་ གོ་ཆ་ དང་ །_ ཀུན་ འགྱུར་བ འི་ གོ་ཆ་ དང་ །_ སྤྱོད་པ་ ཟབ་པ འི་ གོ་ཆ་ དང་ །_ འགྱུར་བ་ སྐྱོ་བ་ མེད་པ འི་ གོ་ཆ་ དང་ །_ མེ་ཏོག་ རབ་ གཏོར་ དང་ །_ མེ་ཏོག་ རིན་ཆེན་ དང་ །_ དོན་ཡོད་ མིང་ སྒྲོལ་ དང་ །_ དོན་ཡོད་ མིང་ སྒྲོགས་ དང་ །_ དམིགས་པ་ ཀུན་ གྱི་ གོ་ཆ་ བགོས་ དང་ །_ འགྲོ་བ་ ཀུན་ འགྱུར་བ འི་ གོ་ཆ་ བགོས་ དང་ །_ སྤྱོད་པ་ ཟབ་པ འི་ གོ་ཆ་ བགོས་ དང་ །_ འགྱུར་བ་ སྐྱོ་བ་ མེད་པ འི་ གོ་ཆ་ བགོས་ དང་ །_ རྟག་ ཏུ་ རབ་ཏུ་ དགའ་བ འི་ གོ་ཆ་ བགོས་ དང་ །_ རྟག་ ཏུ་ གདུང་བ འི་ གོ་ཆ་ བགོས་ དང་ །_ མི་ལྟ་བ འི་ གོ་ཆ་ བགོས་ དང་ །_ དཔལ་ མ་ ཉམས་པ འི་ གོ་ཆ་ བགོས་ དང་ །_ དྲག་ཤུལ་ འཆང་ དང་ །_ དགའ་བ འི་ སྡེ་ དང་ །_ བཟང་པོ འི་ སྡེ་ དང་ །_ དགའ་བ འི་ ལྷ་ དང་ །_ དགའ་བྱེད་ དང་ །_ བྱང་ཆུབ་ ཡན་ལག་ རྟོགས་ དང་ །_ སངས་རྒྱས་ དང་ མ་ བྲལ་བ འི་ གོ་ཆ་ བགོས་ དང་ །_ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ འི་ གོ་ཆ་ བགོས་ དང་ །_ འཁོར་ལོ་ ཐོགས་པ་ མེད་པ འི་ གོ་ [49a] ཆ་བགོས་ དང་ །_ ཐམས་ཅད་ ཡོངས་སུ་ གཏོང་བ འི་ གོ་ཆ་ བགོས་ དང་ །_ མ་ བླངས་པ འི་ གོ་ཆ་ བགོས་ དང་ །_ རྣམ་པར་ མ་ འཁྲུགས་པ འི་ གོ་ཆ་ བགོས་ དང་ །_ སངས་རྒྱས་ ཀྱི་ གདུང་ རྒྱུན་ མི་ གཅོད་པ འི་ གོ་ཆ་ བགོས་ དང་ །_ ཟླ་བ་ སྣང་ དང་ །_ ཡོན་ཏན་ དཔལ་ སྣང་ དང་ །_ དེད་དཔོན་ དང་ །_ དེད་དཔོན་ ཆེན་པོ་ དང་ །_ མཆོག་ གི་ ཚོགས་ཅན་ དང་ །_ མཆོག་ གི་ བཀོད་པ་ དང་ །_ རིན་པོ་ཆེ འི་ བཀོད་པ་ དང་ །_ དོན་ ཀུན་ འགྲུབ་ དང་ །_ དོན་ དཔལ་ དང་ །_ འདྲེན་པ འི་ དཔལ་ དང་ །_ འདྲེན་པ འི་ རྒྱལ་མཚན་ དང་ །_ ངེས་པ ར་ འདྲེན་ དང་ །_ ཞི་བ་ དང་ །_ རབ་ཏུ་ བྱེད་ དང་ །_ སངས་རྒྱས་ བཟང་པོ་ དང་ །_ ཤིན་ཏུ་ དགའ་བ་ དང་ །_ རྒྱལ་ དགའ་ དང་ །_ དབང་པོ་ ཐུལ་ དང་ །_ རྒྱལ་བ འི་ སྡེ་ དང་ །_ གཞོམ་ ཐུལ་ དང་ །_ བདུད་ འཇོམས་ དང་ །_ དགྲ་ འཇོམས་ དང་ །_ དགྲ་ ལ་ ཞེ་ འགྲས་ མེད་ དང་ །_ ཕྱོགས་ སུ་ རྣམ་པར་ བསྒྲགས་ དང་ །_ རྣམ་པར་ བསྒྲགས་པ འི་ རྒྱལ་པོ་ དང་ །_ ནོར་ འཕེལ་ དང་ །_ བཤེས་གཉེན་ དང་ །_ བཤེས་གཉེན་ ལྷ་ དང་ །_ བཤེས་གཉེན་ འཕེལ་ དང་ །_ གདུགས་ གཅིག་པ་ དང་ །_ རིན་ཆེན་ གདུགས་ དང་ །_ རྒྱུ་སྐར་ བཟང་པོ་ དང་ །_ ཆོས་ དང་ །_ ཆོས་ ལྷ་ དང་ །_ དྲི་མེད་ དང་ །_ དཔའ་བོ་ དྲི་མེད་ དང་ དཔའ་བ འི་ རྩལ་ གྱིས་ འགྲོ་ དང་ །_ མཐའ་ ཡ ས་ རྩལ་ གྱིས་ འགྲོ་ དང་ །_ དོན་ཡོད་ རྩལ་ གྱིས་ འགྲོ་ དང་ །_ གོམ་པ་ མེད་ ཀྱིས་ རྣམ་པར་ གནོན་ དང་ །_ ཤིན་ཏུ་ རྩལ་ གྱིས་ རྣམ་པར་ གནོན་ དང་ །_ ཐ་ མི་ དད་པ ར་ སྤྱོད་པ་ དང་ །_ དེ་དག་ དང་ །_ བྱང་ཆུབ་ སེམས་དཔའ་ གཞན་ ཡང་ བདུན་ ཁྲི་ བདུན་ སྟོང་ ལ་ རྒན་རབས་ དག་ བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ ཀྱི་ ཕྱོགས་ ཀྱི་ ཆོས་ ཡོངས་སུ་ སྨིན་པ ར་ མཛད་པ འི་ ཕྱིར་ པད་མ་ བདུན་པོ་ འདི་དག་ བྱིན་པ་ ཡིན་ ཏེ
en: including Ratnākara , Susārthavāha, Naḍadatta, Indradatta, Varuṇa, Balabhadra, Uttaramati, Viśeṣamati, Vardhamānamati, Amoghadarśin , Susaṃ­prasthita, Suvi­krānta­vikrāmin, Nityo­dyukta, Anikṣiptadhura, Sūryagarbha, Jagatīṃdhara, Dharaṇidhara, Able Intelligence, Anantamati , Trailo­kyavi­krāmin, Anantavikrāmin, Unfathomable Subduer, [48.b] Leader Revealing All Objects of Perception, Dṛḍhamati, Apra­meya­vikrāmin, Meaningful Diligence, Lion of Powerful Diligence, Moving with the Power of Meaningful Steps, Joyous Acumen, Tīkṣṇa­prati­bhāna, Gambhīra­pratibhāna, Boundless Acumen , Aprameya­prati­bhāna, Mañjuśrī­kumāra­bhūta, Padmagarbha, Elephant of Infinity, Knowing neither Increase nor Decrease, Dharmodgata, Ratnapāṇi, Meaningful Glory, Immovable Subjugator, Aśoka, Vigataśoka , Engagement without Difference, Untiring Diligence, Becoming a Womb, Strīvivarta, Becoming a Man, Becoming a Sentient Being, Jālinīprabha, Infinite Essence, Lotus in the Buddha’s Hand, Padmapāṇi, Gandhahastī , Armor of Lion-like Understanding, Meaningful Armor , Irreproachable Armor, Armor of Entering All Realms, Armor of Profound Conduct, Bearer of the Armor Beyond Change and Free from Weariness, Spreader of Flowers, Jewel Flower , Clarifier of the Meaningful Name, Propagator of the Meaningful Name , Bearer of the Armor of All Objects of Perception, Bearer of the Armor of Constant Joy, Bearer of the Armor of Constant Longing, Bearer of the Armor of Impartiality, Bearer of the Armor of Glorious Equality, Bearer of the Fierce, Force of Joy, Force of Benevolence, Śrīharṣa , Nandika, Actualizing the Branches of Awakening, Bearer of the Armor of Never Parting from the Buddhas, Bearer of the Armor of Turning the Dharma Wheel, Bearer of the Armor of the Unimpeded Wheel, [49.a] Bearer of the Armor of Total Relinquishment, Bearer of the Armor of Non-Appropriation, Bearer of the Armor of Being Unperturbed, Bearer of the Armor of Keeping the Lineage of the Buddhas Unbroken, Candrāvaloka, Glorious Light of Qualities, Sārthavāha, Mahāsārthavāha, Supreme Accumulations , Supreme Array, Ratnavyūha, Sarvasiddhārtha, Meaningful Splendor, Glorious Guidance, Guiding Victory Banner, Certain Guidance, Śānta, Perfector, Buddhabhadra, Supriya, Joyous Victor, Jitendriya, Jayasena, Crushing Subduer, Śatrumardana, Without Malice Toward Enemies, Universally Renowned, King of Fame , Increasing Wealth, Mitra, Divine Friend, Growing Friend, Bearer of the Single Parasol, Ratnacchatra, Sunakṣatra, Dharma , Dharmadeva, Vimala , Stainless Hero, Moving with Heroic Strength, Moving with Infinite Strength, Moving with Meaningful Strength, Subduer with Infinite Steps , Treading with Tremendous Power, and Action Beyond Differences. |#| Thus, in all, seventy-seven thousand bodhisattvas received the seven lotus flowers. |#| $258 The Blessed One said, “Elders, the Blessed One gives you these seven lotuses so that you may bring the factors of awakening to maturation.

source: རིགས་ ཀྱི་ བུ་ དག་ ཁྱེད་ཅག་ གིས་ པད་མ་ ཆེན་པོ་ འདི་དག་ ལོངས་ ཤིག་ དང་ །_ ཐམས་ཅད་ གྱུར་ ནས་ བཅོམ་ལྡན་ འདས་ ལ་ དབུལ་བ ར་ བྱ །_
en: Noble sons, take these great flowers, transform them, and offer them to the Blessed One.

source: ཐམས་ཅད་ གྱུར་ ནས་ རང་རང་ གི་ ཐབས་ ལ་ མཁས་པ་ གསལ་བ ར་ བྱ འོ །_། |#| ཞེས་ པད་མ་ བདུན་པོ་ དེ་དག་ བྱིན་ ནོ །_།
en: As you transform the flowers, display your individual skillful means.”

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ བདུན་ ཁྲི་ བདུན་ སྟོང་པོ་ དེ་དག་ གིས་ པད་མ་ དེ་དག་ བླངས་ ནས་ རང་རང་ གི་ ཐབས་ ལ་ མཁས་པ་ གསལ་ [49b] བར་ བྱ་བ འི་ ཕྱིར་ བཅོམ་ལྡན་འདས་ ལ་ ཕུལ་ ལོ །_།
en: $259 Thus, when the seventy-seven thousand bodhisattvas had taken the seven lotus flowers, they offered them to the Blessed One, so that they could each display their skillful means. [49.b]

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ དེ་དག་ ལ་ ཐུགས་ བརྩེ་བ འི་ ཕྱིར་ པད་མ་ ཆེན་པོ་ བདུན་པོ་ དེ་དག་ བཞེས་ ཏེ །_ |#| བཞེས་ ནས་ ཀྱང་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ མ་ཕམ་པ་ ལ་ བཀའ་ སྩལ་པ །_
en: With great love the Blessed One accepted the seven great lotuses, and then said to the bodhisattva great being Ajita,

source: !མ་ཕམ་པ་ དེ་བཞིན་ གཤེགས་པ་ ནི་ ད་ལྟ ར་ ཁྱེད་ ཀྱི་ དགེ་བ འི་ རྩ་བ་ བསྐྱེད་པ འི་ ཕྱིར་ རྟུལ་བ ར་ མཛད །_
en: “Ajita, the Thus-Gone One has practiced diligently#21 so that you may give rise to roots of virtue.

source: !མཆོག་ ཏུ་ རྟུལ་བ ར་ མཛད་ དོ །_།
en: He has practiced with supreme diligence.

source: མ་ཕམ་པ་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ནི་ ཤིན་ཏུ་ རྙེད་པ ར་ དཀའ་ ཞིང་མཆོག་ ཏུ་ རྙེད་པ ར་ དཀ འོ །_།
en: Ajita, a thus-gone one, a blessed one, a perfect buddha is extremely difficult to find, supremely difficult to find.

source: མ་ཕམ་པ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱང་ ཤིན་ཏུ་ མཆོག་ ཏུ་ རྙེད་པ ར་ དཀ འོ །_།
en: Ajita, bodhisattvas are also extremely difficult to find.

source: མ་ཕམ་པ་ སངས་རྒྱས་ ཀྱི་ ཆོས་ དེ་དག་ ནི་ བྱང་ཆུབ་ སེམས་དཔ འི་ སྤྱོད་པ་ ལས་ ངེས་པ ར་ བྱུང་བ འི་ ཕྱིར་ རོ །_།
en: Because, Ajita, buddha qualities manifest from bodhisattva activity.

source: མ་ཕམ་པ་ གལ་ཏེ་ སྔོན་ ངས་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་ པར་མ་ གྱུར་ ན །_ |#| མ་ཕམ་པ་ འོ་ན་ ད་ལྟ ར་ དེ་བཞིན་ གཤེགས་པ འི་ སྟོབས་ བཅུ་ སྐྱེ་བ ར་ འགྱུར་ རམ །_
en: Ajita, would I now possess the ten powers of a thus-gone one if I had not earlier aroused the mind of awakening?”

source: བཅོམ་ལྡན་འདས་ དེ་ མ་ ལགས་སོ །_།
en: “No, Blessed One, you would not,”

source: མ་ཕམ་པ་ འདི་ ཇི་སྙམ་ དུ་ སེམས །_
en: $260 “Ajita,” |#| “what do you think?

source: གལ་ཏེ་ སྔོན་ ངས་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་ པར་མ་ གྱུར་ ན |#| འོ་ན་ ད་ལྟ ར་ མི་ འཇིགས་པ་ བཞི་ སྐྱེ་བ ར་ འགྱུར་ རམ །_
en: Would the four types of fearlessness be present now, if I had not earlier set my mind on unexcelled and perfect awakening?”

source: གལ་ཏེ་ སྔོན་ ངས་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་ པར་མ་ གྱུར་ ན |#| འོ་ན་ ད་ལྟ ར་ འཇིག་རྟེན་ དུ་ དེ་བཞིན་ གཤེགས་པ འི་ བྱམས་པ་ ཆེན་པོ་ འབྱུང་བ ར་ འགྱུར་ རམ །_
en: Would the great love of the Thus-Gone One be present in the world now, if I had not earlier set my mind on unexcelled and perfect awakening?”

source: གལ་ཏེ་ སྔོན་ ངས་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་ པར་མ་ གྱུར་ ན |#| འོ་ན་ ད་ལྟ ར་ འཇིག་རྟེན་ དུ་ སྙིང་རྗེ་ ཆེན་པོ་ འབྱུང་བ ར་ འགྱུར་ རམ །_
en: Would the great compassion of the Thus-Gone One be present in the world now, if I had not earlier set my mind on unexcelled and perfect awakening?

source: དེ་བཞིན་ དུ་ འཇིག་རྟེན་ དུ་ དགའ་བ་ ཆེན་པོ་ དང་ །_ བཏང་སྙོམས་ ཆེན་པོ་ འབྱུང་བ ར་ འགྱུར་ རམ །_ [50a]
en: Or would there be any great joy, or great equanimity?” [50.a]

source: གལ་ཏེ་ སྔོན་ བྱང་ཆུབ་ སེམས་དཔ འི་ སྤྱད་པ་ སྤྱོད་པ་ ན་ ངས་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་ པར་མ་ གྱུར་ ན |#| འོ་ ན་ ད་ལྟ ར་ འཇིག་རྟེན་ དུ་ སངས་རྒྱས་ ཀྱི་ ཆོས་མ་ འདྲེས་པ་ བཅྭ་ བརྒྱད་ འབྱུང་བ ར་ འགྱུར་ རམ །_
en: Would there be any of the eighteen unique qualities of the Buddha in the world now, if I had not earlier, when I was engaged in bodhisattva activity, set my mind on unexcelled and perfect awakening?”

source: གལ་ཏེ་ སྔོན་ བྱང་ཆུབ་ སེམས་དཔ འི་ སྤྱད་པ་ སྤྱོད་པ་ ན་ ངས་ བླ་ ན་ |#| མེད་ པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་ པར་མ་ གྱུར་ ན |#| འོ་ན་ ད་ལྟ ར་ འཇིག་རྟེན་ དུ་ དེ་བཞིན་ གཤེགས་པ འི་ དོན་ཡོད་ རྣམ་པར་ གནོན་པ་ འབྱུང་བ ར་ འགྱུར་ རམ །_
en: Would any of the Thus-Gone One’s meaningful strides be manifest in the world now, if I had not earlier, when I was engaged in bodhisattva activity, set my mind on unexcelled and perfect awakening?”

source: གལ་ཏེ་ སྔོན་ ངས་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་ པར་མ་ གྱུར་ ན |#| འོ་ན་ ད་ལྟ ར་ འཇིག་རྟེན་ དུ་ དེ་བཞིན་ གཤེགས་པ འི་ སེང་གེ འི་ སྟབས་ སུ་ འགྲོ་བ་ ཉིད་ འབྱུང་བ ར་ འགྱུར་ རམ །_
en: Could the lion’s gait of the Thus-Gone One be witnessed in the world now, if I had not earlier set my mind on unexcelled and perfect awakening?”

source: གལ་ཏེ་ སྔོན་ ངས་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་ པར་མ་ གྱུར་ ན |#| འོ་ན་ ད་ལྟ ར་ འཇིག་རྟེན་ དུ་ དེ་བཞིན་ གཤེགས་པ འི་ གླང་པོ་ཆེ འི་ ལྟ་སྟངས་ ཀྱིས་ ལྟ་བ་ ཉིད་ འབྱུང་བ ར་ འགྱུར་ རམ །_
en: Would the Thus-Gone One’s elephant gaze be manifest in the world now, if I had not earlier set my mind on unexcelled and perfect awakening?”

source: བཅོམ་ ལྡན་འདས་ དེ་ མ་ ལགས་སོ །_།
en: “No, Blessed One, it would not,”

source: གལ་ཏེ་ སྔོན་ ངས་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་ པར་མ་ གྱུར་ ན |#| འོ་ན་ ད་ལྟ ར་ འཇིག་རྟེན་ དུ་ དེ་བཞིན་ གཤེགས་པ འི་ སེང་གེ་ ལྟར་ བསྒྱིངས་པ་ ཉིད་ འབྱུང་བ ར་ འགྱུར་ རམ །_
en: Would the lion-like posture of the Thus-Gone One be seen in the world now, if I had not earlier set my mind on unexcelled and perfect awakening?”

source: གལ་ཏེ་ སྔོན་ ངས་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་ པར་མ་ གྱུར་ ན |#| འོ་ན་ ད་ལྟ ར་ འཇིག་རྟེན་ དུ་ དེ་བཞིན་ [50b] གཤེགས་པ འི་ སྤྱི་གཙུག་ བལྟ ར་ མི་ མཐོང་བ་ ཉིད་ འབྱུང་བ ར་ འགྱུར་ རམ །_
en: Would the Thus-Gone One’s indiscernible crown protuberance appear in the world now, if I had not earlier set my mind on unexcelled and perfect awakening?” [50.b]

source: གལ་ཏེ་ སྔོན་ ངས་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་ པར་མ་ གྱུར་ ན |#| འོ་ན་ ད་ལྟ ར་ འཇིག་རྟེན་ དུ་ སྐྱེས་བུ་ ཆེན་པོ འི་ མཚན་ སུམ་ཅུ་རྩ་གཉིས་ འབྱུང་བ ར་ འགྱུར་ རམ །_
en: Would any of the thirty-two marks of a great being be perceptible in the world now, if I had not earlier set my mind on unexcelled and perfect awakening?”

source: གལ་ཏེ་ སྔོན་ ངས་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ སེམས་ བསྐྱེད་ པར་མ་ གྱུར་ ན |#| འོ་ན་ ད་ལྟ ར་ འཇིག་རྟེན་ དུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ་ འབྱུང་བ ར་ འགྱུར་ རམ །_
en: Would I turn the wheel of Dharma in the world now, if had not earlier set my mind on unexcelled and perfect awakening?”

source: གལ་ཏེ་ སྔོན་ ངས་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ ཆུབ་ ཏུ་ སེམས་བསྐྱེད་ པར་མ་ གྱུར་ ན |#| འོ་ན་ ད་ལྟ ར་ འཇིག་རྟེན་ དུ་ ཆོས་ ཀྱི་ མུ ར་ འགྲམ་ འབྱུང་བ ར་ འགྱུར་ རམ །_
en: Would the conch of Dharma be present in the world now, if I had not earlier set my mind on unexcelled and perfect awakening?”

source: གལ་ཏེ་ སྔོན་ ངས་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་ པ འི་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་ པར་མ་ གྱུར་ ན |#| འོ་ན་ ད་ལྟ ར་ འཇིག་རྟེན་ དུ་ ཉན་ཐོས་ ཕུན་སུམ་ ཚོགས་པ་ འབྱུང་བ ར་ འགྱུར་ རམ །_
en: Would there be perfect hearers in the world now, if I had not earlier set my mind on unexcelled and perfect awakening?”

source: མ་ཕམ་པ་ དེ་ལྟ་བས་ན་ གང་དག་ སངས་རྒྱས་ ཀྱི་ ཆོས་ རྣམས་ ཇི་སྙེད་ ཡོད་ པ་ དེ་དག་ ཐམས་ཅད་ ནི་ སེམས་ དང་པོ་ བསྐྱེད་པ་ ལ་ རག་ ལས་པ་ ཡིན་ ནོ །_།
en: $273 “Thus, Ajita,” |#| “each and every element of awakening depends on the initial engendering of that mind.

source: མ་ཕམ་པ་ དེ་ལྟ་བས་ན་ བྱང་ཆུབ་ སེམས་དཔའ་ རྙེད་པ ར་ དཀའ་བ འི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ རྙེད་པ ར་ དཀའ་བ་ ཡིན་ ནོ །_།
en: Ajita, the reason there are so few thus-gone ones is that bodhisattvas are so rare.
